In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
book_ratings = pd.read_csv('book_rental_datasets/book_ratings.csv')
books = pd.read_csv('book_rental_datasets/books.csv')
recommend = pd.read_csv('book_rental_datasets/Recommend.csv')
users = pd.read_csv('book_rental_datasets/users.csv')

br = pd.DataFrame(book_ratings)
b = pd.DataFrame(books)
r = pd.DataFrame(recommend)
u = pd.DataFrame(users)

/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3437: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [3]:

b.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [4]:
u = u.fillna('-1')
u.head()

   user_id                            Location   Age
0        1                  nyc, new york, usa    -1
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia    -1
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom    -1

In [5]:
br.head()

    user_id        isbn  rating
0  276725.0  034545104X       0
1  276726.0   155061224       5
2  276727.0   446520802       0
3  276729.0  052165615X       3
4  276729.0   521795028       6

In [6]:
br['isbn']= br['isbn'].str.replace(r'[^0-9]', '0', regex=True)
b['isbn']= b['isbn'].str.replace(r'[^0-9]', '0', regex=True)

br['isbn'] = pd.to_numeric(br['isbn'])
b['isbn'] = pd.to_numeric(b['isbn'])

print(br.dtypes)
print(b.dtypes)

user_id    float64
isbn         int64
rating       int64
dtype: object
isbn                    int64
book_title             object
book_author            object
year_of_publication    object
publisher              object
dtype: object

In [7]:
# u['user_id']= u['user_id'].str.replace(r'[^0-9]', '0', regex=True)
# u['user_id'] = pd.to_numeric(br['user_id'])
print(u.dtypes)

user_id      int64
Location    object
Age         object
dtype: object

In [8]:
b_sorted = b.sort_values(by='isbn', ascending=True)
u_sorted = u.sort_values(by='user_id', ascending=True)

In [9]:
b_sorted.head(n=1)

,isbn,book_title,book_author,year_of_publication,publisher
99019,0,Hard Eight,Janet Evanovich,2002,St. Martin's Press

In [10]:
u_sorted.head(n=1)

   user_id            Location Age
0        1  nyc, new york, usa  -1

In [11]:

br_sorted = br.sort_values(by=['user_id', 'isbn'], ascending=True)
br_sorted['user_id'] = br_sorted['user_id'].astype(int)
br_sorted.head(n=1)

      user_id       isbn  rating
9561        2  195153448       0

In [7]:
users = u.user_id.unique().shape[0]
bookId = b.isbn.unique().shape[0]
n_bookIds = b['isbn'].max() 
A = np.zeros((users, n_bookIds))
for line in 
data = pd.DataFrame(columns = [users])
data['0'] = isbn

data.head()

In [40]:
b_sorted.head()

,isbn,book_title,book_author,year_of_publication,publisher
99019,0,Hard Eight,Janet Evanovich,2002,St. Martin's Press
118268,0,Roald Dahl's Revolting Rhymes,Roald Dahl,2002,Knopf Books for Young Readers
121842,0,A Kid's Guide To How to Save the Planet,Billy Goodman,0,"iBooks, Inc."
108560,0,Is That a Gun in Your Pocket?: Women's Experie...,Rachel Abramowitz,1900,Random House
16102,1,Discover Your Genius: How to Think Like Histor...,Michael J. Gelb,2002,HarperCollins

In [41]:
u_sorted.head()

   user_id                            Location   Age
0        1                  nyc, new york, usa    -1
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia    -1
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom    -1

In [69]:
user_id = u_sorted['user_id'].to_list()
isbn = b_sorted['isbn'].to_list()

In [71]:
data = np.matrix([user_id[:10], isbn[:10]], dtype=object)
data

matrix([[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
        [0, 0, 0, 0, 1, 8, 79, 90, 900, 900]], dtype=object)

In [59]:
book_ratings = pd.read_csv('book_rental_datasets/book_ratings.csv')
print(book_ratings.head())

    user_id        isbn  rating
0  276725.0  034545104X       0
1  276726.0   155061224       5
2  276727.0   446520802       0
3  276729.0  052165615X       3
4  276729.0   521795028       6

In [67]:
n_users = book_ratings.user_id.unique().shape[0]
n_items = book_ratings.isbn.unique().shape[0]
n_items = book_ratings['isbn'].max()
n_items = re.sub('[^0-9]', '', n_items)
n_items = int(n_items)
A = np.zeros((n_users,n_items))
for line in book_ratings.itertuples():
    A[line[1]-1,line[2]-1] = line[3]
print("Original rating matrix : ",A)

MemoryError: Unable to allocate 294. TiB for an array with shape (95520, 423350229) and data type float64

You have to model a recommendation engine so that users get recommendations for books based on the behavior of similar users.

In [ ]:
# Split your data into two sets (training and testing)
# tuple of user id and book id is unique key

In [ ]:
# Make predictions based on user and item variables

In [ ]:
# Use RMSE to evaluate the predictions